// ___________________________________________________
// Перепишите функцию, используя оператор '?' или '||'
// ___________________________________________________

// function checkAge(age) {
//     if (age > 18) {
//       return true;
//     } else {
//       return confirm('Родители разрешили?');
//     }
//   }

function checkAge(age) {
    return (age > 18) ? true : confirm('Родители разрешили?');
} 

function checkAge(age) {
    return (age > 18) || confirm('Родители разрешили?');
  }

//___________________________________________________________________________________________________________________________   
// Напишите функцию pow(x,n), которая возвращает x в степени n. Иначе говоря, умножает x на себя n раз и возвращает результат.
// __________________________________________________________________________________________________________________________

function pow (x, n) {
    let answer = x;
    for ( let i = 1; i < n; i++){
        answer *= x;
    }
    return answer
}
let x = prompt('write values for x','')

let n = prompt('write values for n','')

alert(pow(x, n));